# SetVCenter

## Description
Procedure SetVCenter sets the Vectorworks document view center.&lt;BR&gt;

```pascal
PROCEDURE SetVCenter(viewCenter : REAL);
```

```python

def vs.SetVCenter(viewCenter):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewCenter|REAL|Coordinates of document view center.|

## Examples
```pascal
SetVCenter(2,4);

```

## Version
Availability: from MiniCAD6.0
## Category
* View / Zoom